Repository: Erebot/Erebot_Module_Countdown
Catalog: data/i18n/*/LC_MESSAGES/Erebot_Module_Countdown.po
Languages: fr_fr

source: <b>BINGO! <var name="nick"/></b> has achieved <b><var name="result"/></b> with this formula: <b><var name="formula"/></b>.
fr_fr: <b>BINGO ! <var name="nick"/></b> a obtenu <b><var name="result"/></b> avec cette formule : <b><var name="formula"/></b>.

source: <b>Usage:</b> !<var name='trigger'/>. Starts a new Countdown game. Given a set of numbers and a target result, contestants must propose formulae to be as close as possible to the result. The first one to get the target result or the closest result wins the game.
fr_fr: <b>Usage :</b> !<var name='trigger'/>. Lance une nouvelle partie Des Chiffres et Des Lettres. Étant donné un ensemble de nombres et un nombre cible, les participants doivent proposer des formules basées sur les nombres fournis pour s'approcher autant que possible du nombre cible. Le premier à atteindre le nombre cible ou qui obtient le résultat le plus proche remporte la partie.

source: A new Countdown game has been started. You must get <b><var name="target"/></b> using the following numbers <for from="numbers" item="number"><b><var name="number"/></b></for>. You have <var name="delay"/> seconds to make suggestions.
fr_fr: Une nouvelle partie des Chiffres et des Lettres commence. Vous devez obtenir <b><var name="target"/></b> grâce aux nombres suivants : <for from="numbers" item="number"><b><var name="number"/></b></for>. Vous avez <var name="delay"/> secondes pour faire des propositions.

source: Congratulations <b><var name="nick"/></b>! You're the closest with <b><var name="result"/></b>.
fr_fr: Félicitations <b><var name="nick"/></b> ! Vous êtes le plus proche avec <b><var name="result"/></b>.

source: Congratulations to <b><var name="nick"/></b> who wins this Countdown game. <b><var name="nick"/></b> has got <b><var name="result"/></b> with this formula: <b><var name="formula"/></b>.
fr_fr: Félicitations à <b><var name="nick"/></b> qui remporte cette partie des Chiffres et des Lettres. <b><var name="nick"/></b> a obtenu <b><var name="result"/></b> avec cette formule : <b><var name="formula"/></b>.

source: Could not register Countdown trigger
fr_fr: Impossible d'enregistrer le déclencheur pour le jeu des Chiffres et des Lettres

source: Division by zero
fr_fr: Division par zéro

source: Expected the formula to be a string
fr_fr: La formule doit être une chaîne de caractères

source: Formulae must be given with the usual notation (eg. '(100+2) * 4 /2 - 7'). The four basic operators (+, -, *, /) and parenthesis are supported. Divisions with a remainder (eg. 5/2) are forbidden.
fr_fr: Les formules doivent être données selon la notation usuelle (p. ex. '(100+2) * 4 /2 - 7'). Les quatre opérateurs basiques (+, -, *, /) et les parenthèses sont supportés. Les divisions avec un reste (p. ex. : 5/2) sont interdites.

source: However, a better result could be achieved (<var name="result"/>) by using this formula: <b><var name="formula"/></b>.
fr_fr: Cependant, un meilleur résultat pouvait être obtenu (<var name="result"/>) en utilisant cette formule : <b><var name="formula"/></b>.

source: No such number or number already used
fr_fr: Nombre inexistant ou déjà utilisé

source: Non integral division
fr_fr: Division non-entière

source: Not bad <b><var name="nick"/></b>, you actually got <b><var name="result"/></b>, but this is not the best formula... Try again ;)
fr_fr: Pas mal <b><var name="nick"/></b>, vous avez obtenu <b><var name="result"/></b>, mais ce n'est pas la meilleure formule... Réessayez ;)

source: Provides the <b><var name="trigger"/></b> command which starts a new Countdown game where contestants must propose a formula to be as close as possible to a given number.
fr_fr: Fournit la commande <b><var name="trigger"/></b> qui démarre une nouvelle partie Des Chiffres et Des Lettres dans laquelle les participants doivent proposer des formules approchant au maximum d'un nombre donné.

source: So far, <b><var name="nick"/></b> has achieved <b><var name="result"/></b> using this formula: <b><var name="formula"/></b>
fr_fr: Pour le moment <b><var name="nick"/></b> a obtenu <b><var name="result"/></b> avec cette formule : <b><var name="formula"/></b>

source: Syntax error
fr_fr: Erreur de syntaxe

source: Time's up! Nobody has made any suggestion. :(
fr_fr: Délai dépassé ! Personne n'a fait de proposition. :(

source: You must get <b><var name="target"/></b> using the following numbers: <for from="numbers" item="number"><b><var name="number"/></b></for>.
fr_fr: Vous devez obtenur <b><var name="target"/></b> en utilisant les nombres suivants : <for from="numbers" item="number"><b><var name="number"/></b></for>.
